Documents/бит_ВводНачальныхОстатковПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводНачальныхОстатковПоКУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийВводНачальныхОстатковПоКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/бит_ВидыОперацийВводНачальныхОстатковПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийВводНачальныхОстатковПоКУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводИнтегральногоНачальногоСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДифференциальногоНачальногоСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковПоПериоду</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ВводНачальныхОстатковПоКУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПодготовкаПараметровПроведенияДокумента

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизиты(НомераТаблиц)+
					ТекстЗапросаСписокУслуг(НомераТаблиц)+
					ТекстЗапросаСписокЛС(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	ПараметрыПроведения.Реквизиты = ПараметрыПроведения.Реквизиты[0]; 
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаРеквизиты(НомераТаблиц)
	
	// БИТ_ЖКХ 30.09.2016 12:29:47 Начало правки... Временно
	//НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты", 0);
	// БИТ_ЖКХ 30.09.2016 12:29:48 Конец правки. 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ВводНачальныхОстатковПоКУ.Ссылка,
	|	бит_ВводНачальныхОстатковПоКУ.Дата,
	|	бит_ВводНачальныхОстатковПоКУ.Организация,
	|	бит_ВводНачальныхОстатковПоКУ.Ответственный,
	|	бит_ВводНачальныхОстатковПоКУ.Комментарий,
	|	бит_ВводНачальныхОстатковПоКУ.Проведен
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПоКУ КАК бит_ВводНачальныхОстатковПоКУ
	|ГДЕ
	|	бит_ВводНачальныхОстатковПоКУ.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции // ()
 
Функция ТекстЗапросаСписокУслуг(НомераТаблиц)

	// БИТ_ЖКХ 30.09.2016 12:30:06 Начало правки... 
	//НомераТаблиц.Вставить("СписокУслуг", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписокУслуг", 2);
	// БИТ_ЖКХ 30.09.2016 12:30:07 Конец правки. 
	
	// БИТ_ЖКХ 30.09.2016 11:21:36 Начало правки... 
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Ссылка КАК Регистратор,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.НомерСтроки,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.ЛицевойСчет,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Услуга,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Сальдо,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Начисления,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Сумма,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Приоритет,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.ШаблонИзвещений,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Начислено,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.СчетАбонента,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Субконто1,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Субконто2,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Субконто3,
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.СчетКУ
	|ПОМЕСТИТЬ ВТ_ОстаткиУслуги
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПоКУ.СписокУслуг КАК бит_ВводНачальныхОстатковПоКУСписокУслуг
	|ГДЕ
	|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Ссылка = &Ссылка
	|	И НЕ бит_ВводНачальныхОстатковПоКУСписокУслуг.Сумма = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиУслуги.Регистратор,
	|	ВТ_ОстаткиУслуги.НомерСтроки,
	|	ВТ_ОстаткиУслуги.ЛицевойСчет,
	|	ВТ_ОстаткиУслуги.Услуга,
	|	ВТ_ОстаткиУслуги.Сальдо,
	|	ВТ_ОстаткиУслуги.Начисления,
	|	ВТ_ОстаткиУслуги.Сумма,
	|	ВТ_ОстаткиУслуги.Приоритет,
	|	ВТ_ОстаткиУслуги.ШаблонИзвещений,
	|	ВТ_ОстаткиУслуги.Начислено,
	|	ВТ_ОстаткиУслуги.СчетАбонента,
	|	ВТ_ОстаткиУслуги.Субконто1,
	|	ВТ_ОстаткиУслуги.Субконто2,
	|	ВТ_ОстаткиУслуги.Субконто3,
	|	ВТ_ОстаткиУслуги.СчетКУ,
	|	ВЫБОР
	|		КОГДА бит_ВводНачальныхОстатковПоКУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводНачальныхОстатковПоПериоду)
	|			ТОГДА бит_ВводНачальныхОстатковПоКУ.Период
	|		ИНАЧЕ бит_ВводНачальныхОстатковПоКУ.Дата
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ВТ_ОстаткиУслуги КАК ВТ_ОстаткиУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ВводНачальныхОстатковПоКУ КАК бит_ВводНачальныхОстатковПоКУ
	|		ПО ВТ_ОстаткиУслуги.Регистратор = бит_ВводНачальныхОстатковПоКУ.Ссылка";
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Ссылка КАК Регистратор,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.НомерСтроки,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.ЛицевойСчет,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Услуга,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Сальдо,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Начисления,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Сумма,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Приоритет,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.ШаблонИзвещений,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Начислено,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.СчетАбонента,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Субконто1,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Субконто2,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Субконто3,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.СчетКУ,
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Ссылка.Дата КАК Период
	//|ИЗ
	//|	Документ.бит_ВводНачальныхОстатковПоКУ.СписокУслуг КАК бит_ВводНачальныхОстатковПоКУСписокУслуг
	//|ГДЕ
	//|	бит_ВводНачальныхОстатковПоКУСписокУслуг.Ссылка = &Ссылка
	//|	И НЕ бит_ВводНачальныхОстатковПоКУСписокУслуг.Сумма = 0";
	// БИТ_ЖКХ 30.09.2016 11:21:39 Конец правки. 
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСписокЛС(НомераТаблиц)

	// БИТ_ЖКХ 30.09.2016 12:30:25 Начало правки... 
	//НомераТаблиц.Вставить("СписокЛС", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписокЛС", 4);
	// БИТ_ЖКХ 30.09.2016 12:30:26 Конец правки. 
	
	// БИТ_ЖКХ 30.09.2016 11:45:02 Конец правки.  
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка КАК Регистратор,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.НомерСтроки,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.ЛицевойСчет,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Услуга,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Сумма,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.СальдоНаЛС,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Приоритет,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.ШаблонИзвещений,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.СчетАбонента,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Субконто1,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Субконто2,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Субконто3,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.СчетКУ
	|ПОМЕСТИТЬ ВТ_ОстаткиЛС
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПоКУ.СписокЛС КАК бит_ВводНачальныхОстатковПоКУСписокЛС
	|ГДЕ
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка = &Ссылка
	|	И НЕ бит_ВводНачальныхОстатковПоКУСписокЛС.Сумма = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиЛС.Регистратор,
	|	ВТ_ОстаткиЛС.НомерСтроки,
	|	ВТ_ОстаткиЛС.ЛицевойСчет,
	|	ВТ_ОстаткиЛС.Услуга,
	|	ВТ_ОстаткиЛС.Сумма,
	|	ВТ_ОстаткиЛС.СальдоНаЛС,
	|	ВТ_ОстаткиЛС.Приоритет,
	|	ВТ_ОстаткиЛС.ШаблонИзвещений,
	|	ВТ_ОстаткиЛС.СчетАбонента,
	|	ВТ_ОстаткиЛС.Субконто1,
	|	ВТ_ОстаткиЛС.Субконто2,
	|	ВТ_ОстаткиЛС.Субконто3,
	|	ВТ_ОстаткиЛС.СчетКУ,
	|	ВЫБОР
	|		КОГДА бит_ВводНачальныхОстатковПоКУ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийВводНачальныхОстатковПоКУ.ВводНачальныхОстатковПоПериоду)
	|			ТОГДА бит_ВводНачальныхОстатковПоКУ.Период
	|		ИНАЧЕ бит_ВводНачальныхОстатковПоКУ.Дата
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ВТ_ОстаткиЛС КАК ВТ_ОстаткиЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ВводНачальныхОстатковПоКУ КАК бит_ВводНачальныхОстатковПоКУ
	|		ПО ВТ_ОстаткиЛС.Регистратор = бит_ВводНачальныхОстатковПоКУ.Ссылка";
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка КАК Регистратор,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.НомерСтроки,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.ЛицевойСчет,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Услуга,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Сумма,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.СальдоНаЛС,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Приоритет,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.ШаблонИзвещений,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.СчетАбонента,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Субконто1,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Субконто2,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Субконто3,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.СчетКУ,
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка.Дата КАК Период
	//|ИЗ
	//|	Документ.бит_ВводНачальныхОстатковПоКУ.СписокЛС КАК бит_ВводНачальныхОстатковПоКУСписокЛС
	//|ГДЕ
	//|	бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка = &Ссылка
	//|	И НЕ бит_ВводНачальныхОстатковПоКУСписокЛС.Сумма = 0";
	// БИТ_ЖКХ 30.09.2016 11:45:05 Конец правки. 
	
	Возврат ТекстЗапроса + бит_ОбщегоНазначения.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти

#КонецЕсли
